@extends('layouts.myapp')

@section('title', 'КИТ')

@section('sidebar')
@parent

@endsection

@section('content')
    <p><center><h1>ІСТОРІЯ КАФЕДРИ</h1></center>
</br>
<p>Кафедра комп'ютерних інформаційних технологій (КІТ) готує бакалаврів, спеціалістів і магістрів за напрямом «Інформаційні технології» зі спеціальності “Комп'ютерні науки та інформаційні технології”.</p>

<p>Історія виникнення кафедри комп'ютерних інформаційних технологій була пов'язана із проблемою підготовки спеціалістів в області комп'ютерних наук, зокрема, з систем автоматизованого проектування (САПР) для підприємств північного регіону Донбасу.</p>

<p>Рішення цієї задачі було покладено на кафедру обчислювальної техніки й автоматизованих систем керування (ОТ і АСУ). Колектив кафедри на чолі з завідувачем, к.т.н., доцентом Петром Володимировичем Васильєвим провів величезну підготовчу роботу з відкриття нової спеціальності. Також був врахований досвід вузів,  які вели підготовку інженерів-системотехніків ‑ МВТУ ім. Баумана, Київського політехнічного інституту, Харківського авіаційного інституту.</p>

<p>У той час в інституті на обчислювальному центрі були встановлені ЕОМ середнього класу: ЄС-1020, ЄС-1036 і «Наірі-2», які забезпечували учбово-методичну й наукову працю викладачів ВНЗ.</p>

<p>Кафедра ОТ і АСУ мала клас персональних ЕОМ «Електроніка Д 3-28». Була розроблена програма технічного переоснащення ВНЗ, насамперед засобами обчислювальної техніки. Були придбані кілька класів ПЕОМ ЄС-1840, ДВК-2, «Нейрон», потім «Mazovia», ЄС-1841, «Іскра-1030».</p>

<p>Все це дозволило в 1989 році здійснити на кафедрі ОТ і АСУ перший набір 25 студентів, майбутніх випускників кваліфікації «інженер-системотехнік». Їхніми першими вчителями стали доценти П.В. Васильєв, Г.Б. Білик, В.Г. Зернов, асистенти А.Г. Забазнова, О.В. Веремій, В.В. Зоненко.</p>

<p>18 грудня 1990 року, згідно з наказом ректора кафедра ОТ і АСУ була перейменована в кафедру систем автоматизованого проектування (САПР). Завідувати кафедрою САПР став завідувач у той час кафедрою ОТ і АСУ доктор технічних наук А.О. Румянцев. З зростом числа студентів зростала й розвивалася кафедра. Були запрошені кандидати технічних наук В.І. Кравченко, В.Р. Дементій.</p>

<p>Викладачі кафедри навчалися разом зі студентами, тому що поява новинок в області інформаційного технологій вимагало їхнього вивчення й впровадження в навчальний процес. Поступово поліпшувалася матеріально-технічна база кафедри, з'явилися IBM PC-286, а з 1991 р. з'явилася перша в ДДМА локальна мережа на 10 робочих місць IBM-PCXT.</p>

<p>Стало зрозуміло, що забезпечити необхідний рівень підготовки студентів спеціальності САПР і одночасно навчати програмуванню студентів інших спеціальностей кафедра САПР у колишньому складі не може.</p>

<p>Наприкінці 1991 року з кафедри САПР виділилася кафедра прикладної математики. Після поділу завідувачем кафедрою САПР став  к.т.н., доцент В.І. Цибанев. На кафедру були запрошені й нові співробітники: кандидати технічних наук Ю.А. Швецов, В.І. Юдін, В.Г. Бойко, Г.П. Удовицький.З 1994 року кафедра стала готувати студентів за спеціальністю «Комп'ютерні системи проектування», а з 1998 року стала  називатися «Інформаційні технології проектування» (ІТП).</p>

<p>З 1996 року завідувачем кафедрою САПР став д.т.н. Олександр Федорович Тарасов.</p>

<p>З його приходом почався новий етап розвитку кафедри. Завідувач кафедрою О.Ф. Тарасов – випускник Жданівського металургійного інституту (нині – Приазовський державний технічний університет). Викладацьку діяльність почав у 1982 році на посаді асистента кафедри обробки металів тиском Краматорського індустріального інституту (КІІ). В 1983 році захистив кандидатську дисертацію. Після закінчення очної докторантури КІІ в 1996 році О.Ф. Тарасов захистив докторську дисертацію. За результатами його наукових досліджень опубліковано більше 200 наукових праць, отримано більше 50 авторських свідоцтв і патентів України.</p>

<p>Зараз О.Ф. Тарасов є заступником голови науково-технічної ради академії, членом двох спеціалізованих рад по захисту докторських дисертацій при ДДМА та Кременчуцького нац. техн. університету ім. М. Острограцькогой, є членом Вченої та методичної Рад Академії, членом редакційних рад двох наукових видань, які входять у перелік ВАК України. У 2004 – 2008 р.р. – член експертної ради по комп'ютерним наукам ДАК Міністерства освіти і науки України.</p>

<p>У той час були запрошені кандидати технічних наук П.І. Сагайда, В.В. Савицький. Кафедра пройшла акредитацію на IV рівень, почалася підготовка фахівців зі схеми бакалавр-спеціаліст і бакалавр-магістр. Розроблено нові робочі програми дисциплін, повністю оновлено їхнє методичне забезпечення. Обновився парк ПЕОМ. На той час на кафедрі були уведені в експлуатацію 3 дисплейних класи, укомплектовані персональними комп'ютерами моделі: ДО 6-300, ДО 6-2-35, Celeron 400.</p>

<p>В 1996 році д.т.н. О.Ф. Тарасов організував Центр інтегрованих систем автоматизованого проектування разом із ЗАТ НКМЗ на базі заводської філії кафедри.</p>

<p>В 1998 році кафедра САПР була перейменована в кафедру комп'ютерних інформаційних технологій (КІТ). З 1999 року при кафедрі відкрита аспірантура, науковим керівником якої є д.т.н. О.Ф. Тарасов. В 2000 році зроблений перший випуск магістрів комп'ютерних наук.</p>

<p>На теперішній час на підприємствах Донбасу й інших регіонів працюють випускники кафедри КІТ, багато хто з них займають керівні й відповідальні посади. За всю історію кафедри було випущено більше 500 фахівців в області інформаційних технологій. Тематика дипломних проектів і робіт випускників присвячена створенню й обробці баз даних, удосконалюванню апаратної й системної частин обчислювальних систем, розробці й впровадженню програмного забезпечення для комп'ютерних мереж Інтернет, CAD/CAM/CAE і інших систем.</p>
 <p>
            <a href="{{route('teachers')}}">Перейти к преподавателям</a></p>
            <p>
            <a href="{{route('subjects')}}">Перейти к предметам</a></p>
            <p>
            <a href="{{route('auditories')}}">Перейти к аудиториям</a></p>
@endsection